ustczzh/nrf52-keyboard/keyboard/hhkb/protocol/ble/ble_service.c
        m_whitelist_peer_cnt = BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT;
        ret                  = pm_peer_id_list(m_whitelist_peers, &m_whitelist_peer_cnt, PM_PEER_ID_INVALID, PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);
        APP_ERROR_CHECK(ret);

        NRF_LOG_INFO("advertising_start: m_whitelist_peer_cnt %d, MAX_PEERS_WLIST %d", m_whitelist_peer_cnt, BLE_GAP_WHITELIST_ADDR_MAX_COUNT);

        ret = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
        APP_ERROR_CHECK(ret);

        ret = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
        if (ret != NRF_ERROR_NOT_SUPPORTED) {
            APP_ERROR_CHECK(ret);
        }

        ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(ret);
        ble_disable = false;
    }
}

void advertising_without_whitelist() {
    if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {
        if (ble_disable == true) {
            advertising_start(false);
        }
        uint32_t err_code;
        err_code = ble_advertising_restart_without_whitelist(&m_advertising);
        if (err_code != NRF_ERROR_INVALID_STATE) {
            APP_ERROR_CHECK(err_code);
        }
    }
}

void ble_disconnect(void) {
    ret_code_t ret;
    if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {
        ret_code_t ret;
        ret = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        if (ret != NRF_ERROR_INVALID_STATE) {
            APP_ERROR_CHECK(ret);
        }
        ble_disable = true;
    } else {
        ret = sd_ble_gap_adv_stop(m_advertising.adv_handle);
        if (ret != NRF_ERROR_INVALID_STATE) {
            APP_ERROR_CHECK(ret);
        }
        ble_disable = true;
    }
}

void restart_advertising_id(uint8_t id) {
    ret_code_t ret;

    if (!ble_disable && m_conn_handle == BLE_CONN_HANDLE_INVALID) {
        ret = sd_ble_gap_adv_stop(m_advertising.adv_handle);
        if (ret != NRF_ERROR_INVALID_STATE) {
            APP_ERROR_CHECK(ret);
        }
    }

    m_whitelist_peer_cnt = BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT;
    ret_code_t err_code  = pm_peer_id_list(m_whitelist_peers, &m_whitelist_peer_cnt, PM_PEER_ID_INVALID, PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);
    APP_ERROR_CHECK(err_code);
    if (id > m_whitelist_peer_cnt) {
        return;
    }
    m_whitelist_peer_cnt = 1;
    m_whitelist_peers[0] = m_whitelist_peers[id];

    ret = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
    APP_ERROR_CHECK(ret);

    ret = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
    if (ret != NRF_ERROR_NOT_SUPPORTED) {
        APP_ERROR_CHECK(ret);
    }

    if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {
        ble_adv_modes_config_t options;
        memset(&options, 0, sizeof(options));
        options.ble_adv_whitelist_enabled          = true;
        options.ble_adv_directed_high_duty_enabled = false;
        options.ble_adv_directed_enabled           = false;
        options.ble_adv_fast_enabled               = true;
        options.ble_adv_fast_interval              = APP_ADV_FAST_INTERVAL;
        options.ble_adv_fast_timeout               = APP_ADV_FAST_DURATION;
        options.ble_adv_slow_enabled               = true;
        options.ble_adv_slow_interval              = APP_ADV_SLOW_INTERVAL;
        options.ble_adv_slow_timeout               = APP_ADV_SLOW_DURATION;
        ble_advertising_modes_config_set(&m_advertising, &options);

        ret = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        if (ret != NRF_ERROR_INVALID_STATE) {
            APP_ERROR_CHECK(ret);
        }
    } else {
        ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(ret);
        ble_disable = false;
    }
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const *p_evt) {
    // pm_handler_on_pm_evt(p_evt);
    // pm_handler_flash_clean(p_evt);
    ret_code_t err_code;

    switch (p_evt->evt_id) {
        case PM_EVT_BONDED_PEER_CONNECTED: {
            NRF_LOG_DEBUG("Connected to a previously bonded device.");
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED: {
            NRF_LOG_INFO("Connected to device %d.", p_evt->peer_id);
            NRF_LOG_DEBUG("Connection secured: role: %d, conn_handle: 0x%x, procedure: %d, id: %d.", ble_conn_state_role(p_evt->conn_handle), p_evt->conn_handle, p_evt->params.conn_sec_succeeded.procedure, p_evt->peer_id);

            m_peer_id = p_evt->peer_id;
        } break;

        case PM_EVT_STORAGE_FULL: {
            NRF_LOG_INFO("PM storage full");
            err_code = fds_gc();
            if (err_code == FDS_ERR_BUSY || err_code == FDS_ERR_NO_SPACE_IN_QUEUES) {
                // Retry.
            } else {
                APP_ERROR_CHECK(err_code);
            }
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ: {
            // Reject pairing request from an already bonded peer.
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        } break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED: {
            NVIC_SystemReset();
        } break;

        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
            if (p_evt->params.peer_data_update_succeeded.flash_changed && (p_evt->params.peer_data_update_succeeded.data_id == PM_PEER_DATA_ID_BONDING)) {
                NRF_LOG_INFO("New Bond, add the peer to the whitelist if possible");
                // Note: You should check on what kind of white list policy your application should use.
                NRF_LOG_INFO("pm_evt_handler: m_whitelist_peer_cnt %d, MAX_PEERS_WLIST %d", m_whitelist_peer_cnt + 1, BLE_GAP_WHITELIST_ADDR_MAX_COUNT);
                // Note: You should check on what kind of white list policy your application should use.

                m_whitelist_peer_cnt = BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT;
                err_code             = pm_peer_id_list(m_whitelist_peers, &m_whitelist_peer_cnt, PM_PEER_ID_INVALID, PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);
                APP_ERROR_CHECK(err_code);

                err_code = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
                if (err_code != NRF_ERROR_NOT_SUPPORTED) {
                    APP_ERROR_CHECK(err_code);
                }
                err_code = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
                APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            break;
    }
}

